# AdvancedGlazing Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedGlazing Class
Members See Also
---
A static class that provides access to the property names that appear in the AdvancedGlazing visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static class AdvancedGlazing
```

Visual Basic
---
```text
Public NotInheritable Class AdvancedGlazing
```

Visual C++
---
```text
public ref class AdvancedGlazing abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AdvancedGlazing
# See Also
AdvancedGlazing Members
Autodesk.Revit.DB.Visual Namespace